app/Controllers/Produk.php

SELECT *
FROM `kategori`
SELECT *
FROM `satuan`
---
    public function index()
    {
        //proteksi halaman
        //if (session()->get('username') == '') {
        //    session()->setFlashdata('gagal', ' Anda Belum Login.');
        //    return redirect()->to(base_url('Home'));
        //}

        $data = [
            'judul' => 'Master Data',
            'subjudul' => 'Produk',
            'menu' => 'masterdata',
            'submenu' => 'produk',
            'page' => 'v_produk',
            'produk' => $this->produk->getAllProduk(),
            'kategori' => $this->kategori->findAll(),
            'satuan' => $this->satuan->findAll(),