app/Models/ModelAdmin.php

SELECT `jual`.`tgl_jual`, SUM(`detailpenjualan`.`subtotal`) AS `subtotal`, SUM(`detailpenjualan`.`profit`) AS `profit`
FROM `detailpenjualan`
JOIN `jual` ON `jual`.`no_faktur`=`detailpenjualan`.`no_faktur`
WHERE month(jual.tgl_jual) = '02'
AND year(jual.tgl_jual) = '2024'
GROUP BY `jual`.`tgl_jual`
---
    public function GrafikP()
    {
        return $this->db->table('detailpenjualan')
            ->join('jual', 'jual.no_faktur=detailpenjualan.no_faktur')
            ->where('month(jual.tgl_jual)', date('m'))
            ->where('year(jual.tgl_jual)', date('Y'))
            ->select('jual.tgl_jual')
            ->groupBy('jual.tgl_jual')
            ->selectSum('detailpenjualan.subtotal')
            ->selectSum('detailpenjualan.profit')
            ->get()
            ->getResultArray();

SELECT SUM(`detailpenjualan`.`subtotal`) AS `subtotal`
FROM `detailpenjualan`
JOIN `jual` ON `jual`.`no_faktur`=`detailpenjualan`.`no_faktur`
WHERE `jual`.`tgl_jual` = '2024-02-27'
GROUP BY `jual`.`tgl_jual`
---
    public function DayIncome()
    {
        return $this->db->table('detailpenjualan')
            ->join('jual', 'jual.no_faktur=detailpenjualan.no_faktur')
            ->where('jual.tgl_jual', date('Y-m-d'))
            ->groupBy('jual.tgl_jual')
            ->selectSum('detailpenjualan.subtotal')
            ->get()->getRowArray();

SELECT SUM(`detailpenjualan`.`subtotal`) AS `subtotal`
FROM `detailpenjualan`
JOIN `jual` ON `jual`.`no_faktur`=`detailpenjualan`.`no_faktur`
WHERE month(jual.tgl_jual) = '02'
AND year(jual.tgl_jual) = '2024'
GROUP BY month(jual.tgl_jual)
---
    public function MonthIncome()
    {
        return $this->db->table('detailpenjualan')
            ->join('jual', 'jual.no_faktur=detailpenjualan.no_faktur')
            ->where('month(jual.tgl_jual)', date('m'))
            ->where('year(jual.tgl_jual)', date('Y'))
            // ->select('jual.tgl_jual')
            ->groupBy('month(jual.tgl_jual)')
            ->selectSum('detailpenjualan.subtotal')
            ->get()
            ->getRowArray();

SELECT SUM(`detailpenjualan`.`subtotal`) AS `subtotal`
FROM `detailpenjualan`
JOIN `jual` ON `jual`.`no_faktur`=`detailpenjualan`.`no_faktur`
WHERE year(jual.tgl_jual) = '2024'
GROUP BY year(jual.tgl_jual)
---
    public function YearIncome()
    {
        return $this->db->table('detailpenjualan')
            ->join('jual', 'jual.no_faktur=detailpenjualan.no_faktur')
            ->where('year(jual.tgl_jual)', date('Y'))
            // ->select('jual.tgl_jual')
            ->groupBy('year(jual.tgl_jual)')
            ->selectSum('detailpenjualan.subtotal')
            ->get()
            ->getRowArray();

SELECT COUNT(*) AS `numrows` FROM `produk`
---
    public function TProduk()
    {
        return $this->db->table('produk')->countAll();

SELECT COUNT(*) AS `numrows` FROM `kategori`
---
    public function TKategori()
    {
        return $this->db->table('kategori')->countAll();

SELECT COUNT(*) AS `numrows` FROM `satuan`
---
    public function TSatuan()
    {
        return $this->db->table('satuan')->countAll();

SELECT COUNT(*) AS `numrows` FROM `user`
---
    public function TUser()
    {
        return $this->db->table('user')->countAll();