app/Models/ModelProduk.php

    public function updateData($data)
    {
        $this->db->table('produk')
        ->where('id_produk', $data['id_produk'])
        ->Update($data);
---
UPDATE `produk` SET `id_produk` = '22', `nama_produk` = 'Indomie Goreng Aceh', `id_kategori` = '6', `id_satuan` = '21', `harga_beli` = '1700', `harga_jual` = '3500', `stok` = '100'
WHERE `id_produk` = '22'