app/Models/ModelUser.php

    public function LoginUser($username, $password)
    {
        return $this->db->table('user')
            ->where([
                'username' => $username,
                'password' => $password,
            ])->get()->getRowArray();
---
SELECT *
FROM `user`
WHERE `username` = 'cna'
AND `password` = '202cb962ac59075b964b07152d234b70'